<!DOCTYPE HTML PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html dir="ltr" lang="en"><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><meta name="keywords" content="Gi&#7899;i thi&#7879;u v&#7873; NetBeans ? môi tr&#432;&#7901;ng phát tri&#7875;n mã ngu&#7891;n m&#7903; dành cho l&#7853;p trình viên J2, Vietnamese IT, dien dan tin hoc, Vietnamese IT, tin hoc, thu thuat tin hoc , ho tro tin hoc, so hoa, hoa hoc, computer"><meta name="description" content="[Archive] Gi&#7899;i thi&#7879;u v&#7873; NetBeans ? môi tr&#432;&#7901;ng phát tri&#7875;n mã ngu&#7891;n m&#7903; dành cho l&#7853;p trình viên J2 Programming"><title>Gi&#7899;i
thi&#7879;u v&#7873; NetBeans ? môi tr&#432;&#7901;ng phát tri&#7875;n mã ngu&#7891;n m&#7903; dành cho l&#7853;p
trình viên J2 [Archive] - VocViTinh.com : Information Technology
Community &amp; Resource</title></head><body><div style="text-align: center;"><table align="center" border="0" cellpadding="0" cellspacing="0">
<tbody><tr>
<td colspan="2">


<iframe src="su%20dung%20netbean_files/vocvitinh_728top.htm" allowtransparency="true" marginheight="0" marginwidth="0" scrolling="no" width="728" frameborder="0" height="90"></iframe>


</td>
</tr>
<tr>
<td align="left">
<font size="-3"><a href="http://www.vocvitinh.com/archive/index.php/payments.php"><b>join V.I.P and remove this ads</b></a></font></td>
<td align="right"><font size="-3"><a href="http://www.vocvitinh.com/archive/index.php/payments.php"><b>gia nh&#7853;p V.I.P s&#7869; không th&#7845;y qu&#7843;ng cáo
</b></a></font>
</td>
</tr>
</tbody></table></div><br>


	
	
	
	
	
	<link rel="stylesheet" type="text/css" href="su%20dung%20netbean_files/archive.css">

<div class="pagebody">
<div id="navbar"><a href="http://www.vocvitinh.com/archive/index.php/">VocViTinh.com : Information Technology Community &amp; Resource</a> &gt; <a href="http://www.vocvitinh.com/archive/index.php/f-5.html">PROGRAMMING - DEVELOPMENT - DESIGN</a> &gt; <a href="http://www.vocvitinh.com/archive/index.php/f-6.html">Programming</a> &gt; Gi&#7899;i thi&#7879;u v&#7873; NetBeans ? môi tr&#432;&#7901;ng phát tri&#7875;n mã ngu&#7891;n m&#7903; dành cho l&#7853;p trình viên J2</div>
<hr>
<div class="pda"><a href="http://www.vocvitinh.com/archive/index.php/t-2071.html?pda=1" rel="nofollow">PDA</a></div>
<p class="largefont">View Full Version : <a href="http://www.vocvitinh.com/showthread.php?t=2071">Gi&#7899;i thi&#7879;u v&#7873; NetBeans ? môi tr&#432;&#7901;ng phát tri&#7875;n mã ngu&#7891;n m&#7903; dành cho l&#7853;p trình viên J2</a></p>
<hr>

<div class="post"><div class="posttop"><div class="username">anhcakho</div><div class="date">09-01-2007, 05:05 PM</div></div><div class="posttext">Gi&#7899;i
thi&#7879;u v&#7873; NetBeans &#8211; môi tr&#432;&#7901;ng phát tri&#7875;n mã ngu&#7891;n m&#7903; dành cho l&#7853;p
trình viên J2ME [Only registered and activated users can see links] B&#7841;n
s&#7869; ng&#7841;c nhiên v&#7873; nh&#7919;ng gì mà c&#7897;ng &#273;&#7891;ng mã ngu&#7891;n m&#7903; &#273;em l&#7841;i cho b&#7841;n. N&#7871;u
nh&#432; Linux ph&#7843;i c&#7847;n h&#417;n 10 n&#259;m &#273;&#7875; có th&#7875; ti&#7871;n g&#7847;n &#273;&#7871;n m&#7909;c tiêu là &#273;&#7889;i
tr&#7885;ng c&#7911;a Windows cho dòng máy &#273;&#7875; bàn thì các &#7913;ng d&#7909;ng IDE (Integrated
Development Environment- môi tr&#432;&#7901;ng phát tri&#7875;n tích h&#7907;p) ch&#7881; m&#7845;t m&#7897;t
n&#7919;a th&#7901;i gian &#273;&#7875; có th&#7875; là &#273;&#7889;i th&#7911; t&#432;&#417;ng x&#7913;ng v&#7899;i các dòng s&#7843;n ph&#7849;m
th&#432;&#417;ng m&#7841;i danh tí&#7871;ng nh&#432; Borland Jbuilder, Code Warrior, Oracle
JDeveloper ...<br>
<br>
M&#7897;t trong nh&#7919;ng nguyên nhân chính giúp các s&#7843;n ph&#7849;m mã ngu&#7891;n m&#7903; trong
dòng s&#7843;n ph&#7849;m này phát tri&#7875;n nh&#432; v&#361; bão nh&#432; hi&#7879;n nay là s&#7921; h&#7895; tr&#7907; t&#7915;
các &#273;&#7841;i gia trong gi&#7899;i công ngh&#7879;, ví d&#7909; nh&#432; trong s&#7843;n ph&#7849;m NetBeans là
s&#7921; xu&#7845;t hi&#7879;n c&#7911;a Sun Microsystems và trong s&#7843;n ph&#7849;m Eclipse là &#8220;ông
trùm&#8221; IBM.<br>
M&#7897;t giao di&#7879;n chuyên nghi&#7879;p &#273;&#7871;n không ng&#7901; &#273;ó là &#7845;n t&#432;&#7907;ng &#273;&#7847;u tiên c&#7911;a
tôi khi download NetBeans t&#7915; trên m&#7841;ng, lúc &#273;ó v&#7851;n còn là b&#7843;n 3.5.1,
còn &#273;&#7871;n b&#7843;n 3.6 hi&#7879;n nay thì tôi &#273;ã hoàn toàn b&#7883; thuy&#7871;t ph&#7909;c v&#7873; s&#7843;n
ph&#7849;m này và quy&#7871;t &#273;&#7883;nh chuy&#7875;n toàn b&#7897; d&#7921; án Java c&#7911;a tôi sang s&#7917; d&#7909;ng
NetBeans. NetBeans có m&#7897;t l&#7907;i th&#7871; mà các s&#7843;n ph&#7849;m th&#432;&#417;ng m&#7841;i khác không
th&#7875; có, &#273;ó là chi phí b&#7843;n quy&#7873;n. N&#7871;u b&#7841;n &#273;ã có d&#7883;p s&#7917; d&#7909;ng qua NetBeans
thì b&#7841;n không th&#7875; ng&#7901; &#273;ây là 1 s&#7843;n ph&#7849;m mã ngu&#7891;n m&#7903; và b&#7841;n có th&#7875; s&#7917;
d&#7909;ng hoàn toàn mi&#7877;n phí.<br>
<br> Trong b&#7889;i c&#7843;nh Vi&#7879;t Nam ph&#7843;i th&#7921;c thi lu&#7853;t b&#7843;n quy&#7873;n khi gia nh&#7853;p
WTO thì các dòng s&#7843;n ph&#7849;m mã ngu&#7891;n m&#7903; này chính là m&#7897;t c&#7913;u cánh l&#7899;n cho
gi&#7899;i l&#7853;p trình viên Vi&#7879;t Nam. Các doanh nghi&#7879;p ph&#7847;n m&#7873;m không có lý do
gì &#273;&#7875; ph&#7843;i tr&#7843; trên 1000 USD cho các IDE quen thu&#7897;c mà l&#7841;i không làm
quen v&#7899;i các IDE Open Source.<br>
Trong ph&#7841;m vi bài vi&#7871;t này, tác gi&#7843; mong mu&#7889;n ng&#432;&#7901;i &#273;&#7885;c có th&#7875; làm quen
v&#7899;i vi&#7879;c s&#7917; d&#7909;ng môi tr&#432;&#7901;ng phát tri&#7875;n NetBeans, tr&#432;&#7899;c m&#7855;t là trong
cu&#7897;c thi Mobile Games 2004 và sau &#273;ó là trong công vi&#7879;c c&#7911;a mình.<br>
 <br>
1.    Download NetBeans IDE:<br>
  B&#7841;n có th&#7875; t&#7843;i v&#7873; t&#7915; Internet, hãy vào &#273;&#7883;a ch&#7881; sau:<br>
[Only registered and activated users can see links]  và làm theo h&#432;&#7899;ng d&#7851;n trên trang web, b&#7843;n &#273;&#7847;y &#273;&#7911; kho&#7843;ng 36 Mb<br>
2.    Các khái ni&#7879;m c&#417; b&#7843;n c&#7847;n n&#7855;m tr&#432;&#7899;c khi s&#7917; d&#7909;ng NetBeans:<br>
<br>
1. Xác &#273;&#7883;nh Mount FileSystem: N&#7871;u b&#7841;n &#273;ã có kinh nghi&#7879;m l&#7853;p trình Java
thì khái ni&#7879;m Mount khá gi&#7889;ng v&#7899;i vi&#7879;c xác &#273;&#7883;nh Classpath khi biên d&#7883;ch
và ch&#7841;y &#7913;ng d&#7909;ng Java b&#7857;ng dòng l&#7879;nh. NetBeans &#273;ã &#273;&#432;a ra m&#7897;t khái ni&#7879;m
m&#7899;i là FileSystem. V&#7899;i vi&#7879;c xác &#273;&#7883;nh FileSystem và &#8220;mount&#8221; chúng v&#7899;i mã
ngu&#7891;n, NetBeans s&#7869; biên d&#7883;ch (compile) mã ngu&#7891;n và copy các file .class
vào c&#7845;u trúc th&#432; m&#7909;c nh&#432; trong khai báo package. Ngoài ra, n&#7871;u mã ngu&#7891;n
c&#7911;a b&#7841;n có s&#7917; d&#7909;ng các th&#432; vi&#7879;n l&#7853;p trình khác thì vi&#7879;c khai báo trong
FileSystem s&#7869; báo cho trình biên d&#7883;ch bi&#7871;t n&#417;i c&#7847;n tìm các th&#432; vi&#7879;n c&#7847;n
thi&#7871;t. Vi&#7879;c xác &#273;&#7883;nh &#273;úng FileSystem s&#7869; tránh &#273;&#432;&#7907;c l&#7895;i
FileNotFoundException, &#273;ây là m&#7897;t l&#7895;i r&#7845;t c&#417; b&#7843;n &#273;&#7889;i v&#7899;i ng&#432;&#7901;i m&#7899;i b&#7855;t
&#273;&#7847;u l&#7853;p trình Java.<br>
<br> 2. Cài &#273;&#7863;t J2ME Plug-in: &#272;&#7875; &#273;áp &#7913;ng tr&#432;&#7899;c s&#7921; phát tri&#7875;n nh&#432; v&#361; bão
c&#7911;a CNTT nh&#432; hi&#7879;n nay thì m&#7885;i môi tr&#432;&#7901;ng ph&#7847;n m&#7873;m ph&#7843;i là m&#7903; t&#7913;c là cho
phép các hãng ph&#7847;n m&#7873;m khác vi&#7871;t các ph&#7847;n b&#7893; sung (thu&#7853;t ng&#7919; ti&#7871;ng Anh
g&#7885;i là Plugin) và tích h&#7907;p &#273;&#432;&#7907;c v&#7899;i ph&#7847;n m&#7873;m. NetBeans là m&#7897;t môi
tr&#432;&#7901;ng nh&#432; v&#7853;y. B&#7841;n có th&#7875; ch&#7885;n l&#7921;a các Plugins cho nhu c&#7847;u c&#7911;a mình,
NetBeans cung c&#7845;p h&#417;n 50 Plugin mi&#7877;n phí, J2ME Plugin là m&#7897;t trong s&#7889;
&#273;ó. Có hai cách &#273;&#7875; cài &#273;&#7863;t J2ME plugin vào máy c&#7911;a các b&#7841;n. Ho&#7863;c các
b&#7841;n s&#7917; d&#7909;ng tính n&#259;ng update c&#7911;a Netbeans ho&#7863;c các b&#7841;n download các
Plugins này v&#7873; và cài &#273;&#7863;t. Do &#273;i&#7873;u ki&#7879;n Internet &#7903; VN nên tôi ch&#7885;n cách
th&#7913; hai.<br>
&#8226; Download các Plug-in h&#7895; tr&#7907; vi&#7879;c l&#7853;p trình J2ME: Tham kh&#7843;o ph&#7847;n ph&#7909; l&#7909;c, tôi gi&#7843; s&#7917; các b&#7841;n l&#432;u các Plugins &#7903; th&#432; m&#7909;c D:\Soft<br>
[Only registered and activated users can see links]<br>
&#8226; Cài &#273;&#7863;t: Cách cài &#273;&#7863;t các Plugins t&#432;&#417;ng t&#7921; nhau và r&#7845;t d&#7877; dàng. Tôi
ch&#7881; nêu ra m&#7897;t ví d&#7909; khi cài &#273;&#7863;t J2ME Wireless Toolkit. Các b&#7841;n vào
menu Tools-&gt; Update Center. Do ch&#7885;n cách cài &#273;&#7863;t offline nên các b&#7841;n
ch&#7885;n Install Manually Downloaded Modules (.nbm Files) và b&#7845;m Next. C&#7917;a
s&#7893; nh&#432; hình d&#432;&#7899;i s&#7869; xu&#7845;t hi&#7879;n.<br>
[Only registered and activated users can see links]<br>
Các b&#7841;n ch&#7885;n nút Add và ch&#7885;n &#273;&#432;&#7901;ng d&#7851;n t&#7899;i th&#432; m&#7909;c l&#432;u tr&#7919; các Plugin,
trong tr&#432;&#7901;ng h&#7907;p này là D:\Soft\kjava-emulator_win.nbm sau &#273;ó ch&#7885;n Next<br>
Và sau &#273;ó là th&#7921;c hi&#7879;n các b&#432;&#7899;c &#273;&#259;ng ký xác nh&#7853;n quy&#7873;n s&#7903; h&#7919;u Plugin
v.v, thao tác r&#7845;t &#273;&#417;n gi&#7843;n nên tôi không h&#432;&#7899;ng d&#7851;n chi ti&#7871;t.<br>
<br> 3. Xác &#273;&#7883;nh Emulator: Trong l&#7853;p trình trên J2ME thì vi&#7879;c xác &#273;&#7883;nh
thi&#7871;t b&#7883; mô ph&#7887;ng tr&#432;&#7899;c khi ch&#7841;y trên thi&#7871;t b&#7883; th&#7853;t r&#7845;t quan tr&#7885;ng, do
&#273;ó, &#273;i&#7873;u mà các l&#7853;p trình viên J2ME c&#7847;n ph&#7843;i chú ý th&#7913; ba là vi&#7879;c tích
h&#7907;p các b&#7897; gi&#7843; l&#7853;p (Emulator) vào NetBeans. M&#7901;i các b&#7841;n tham kh&#7843;o l&#7841;i
hai bài vi&#7871;t &#8220;H&#432;&#7899;ng d&#7851;n s&#7917; d&#7909;ng Samsung JSDK 1.0 &#8221; và &#8220;Phát tri&#7875;n &#7913;ng
d&#7909;ng J2ME v&#7899;i Samsung JaUmi Wireless Toolkit 2.0 &#8221; trong PC World s&#7889;
tháng 6 v&#7873; cách cài &#273;&#7863;t b&#7897; SDK và Emulator c&#7911;a Samsung. <br>
Các b&#7841;n ch&#7885;n Tool -&gt; Device Emulator Registry, m&#7897;t c&#7917;a s&#7893; hi&#7879;n ra nh&#432; hình d&#432;&#7899;i<br>
[Only registered and activated users can see links]<br>
B&#7841;n nh&#7845;n vào nút Add và ch&#7885;n &#273;&#432;&#7901;ng d&#7851;n vào th&#432; m&#7909;c b&#7841;n cài &#273;&#7863;t Samsung
Wireless Toolkit, trên máy tôi là C:\SAMSUNG_WTK20 NetBeans có ch&#7913;c
n&#259;ng tìm Emulator t&#7915; th&#432; m&#7909;c &#273;ã ch&#7885;n.<br>
[Only registered and activated users can see links]<br>
N&#7871;u b&#7841;n th&#7845;y dòng thông báo &#8220;Detected Emulator Type&#8221; nh&#432; hình trên thì
b&#7841;n &#273;ã ch&#7885;n &#273;úng và b&#7841;n nh&#7845;n Next, sau &#273;ó NetBeans s&#7869; li&#7879;t kê các
Emulator c&#7911;a các ch&#7911;ng lo&#7841;i &#273;i&#7879;n tho&#7841;i mà SDK h&#7895; tr&#7907;. T&#7889;t nh&#7845;t là b&#7841;n
ch&#7885;n all và nh&#7845;n Finish.<br>
Sau &#273;ó b&#7841;n hãy ch&#7885;n dòng &#273;i&#7879;n tho&#7841;i Samsung mà b&#7841;n mu&#7889;n ch&#7841;y th&#7917; t&#7915; hình tr&#7921;c quan sau<br>
[Only registered and activated users can see links]<br>
Sau khi &#273;&#7885;c xong ph&#7847;n này, các b&#7841;n &#273;ã bi&#7871;t cách tích h&#7907;p các Emulator
vào NetBeans và xem th&#7917; k&#7871;t qu&#7843; ch&#432;&#417;ng trình tr&#7921;c ti&#7871;p t&#7915; NetBeans.</div></div><hr>


<div class="post"><div class="posttop"><div class="username">anhcakho</div><div class="date">09-01-2007, 05:06 PM</div></div><div class="posttext">3.    Ch&#7841;y th&#7917; các &#7913;ng d&#7909;ng J2ME s&#7917; d&#7909;ng API c&#7911;a Samsung: <br>
M&#7897;t thành viên c&#7911;a JavaVietnam.org là b&#7841;n Nguy&#7877;n Ng&#7885;c Minh (acc minhnn)
&#273;ã vi&#7871;t nh&#7919;ng ví d&#7909; s&#7917; d&#7909;ng API c&#7911;a Samsung SDK. Tôi s&#7869; s&#7917; d&#7909;ng nh&#7919;ng
ví d&#7909; này trong bài vi&#7871;t. Các b&#7841;n có th&#7875; t&#7843;i source code minh h&#7885;a t&#7915;
&#273;&#7883;a ch&#7881; sau:<br>
[Only registered and activated users can see links]<br>
[Only registered and activated users can see links]<br>
&#8226; Thi&#7871;t l&#7853;p FileSystem trong NetBeans: Gi&#7843; s&#7917; tôi &#273;&#7875; mã ngu&#7891;n và các
file có liên quan t&#7841;i t&#7841;i th&#432; m&#7909;c C:\SamsungDemo. V&#7899;i c&#7845;u trúc th&#432; m&#7909;c
nh&#432; hình sau:<br>
V&#7899;i th&#432; m&#7909;c src ch&#7913;a toàn b&#7897; mã ngu&#7891;n và th&#432; m&#7909;c res ch&#7913;a các file tài nguyên cho ví d&#7909; nh&#432; hình &#7843;nh, âm thanh v.v<br>
B&#7841;n vào menu File-&gt; Mount FileSystem... sau &#273;ó ch&#7885;n Local Directory
và nh&#7845;n Next và sau &#273;ó các b&#7841;n ch&#7885;n &#273;&#432;&#7901;ng d&#7851;n th&#432; m&#7909;c t&#7899;i
c:\SamsungDemo\src và nh&#7845;n Finish.<br>
Các b&#7841;n hãy ki&#7875;m tra l&#7841;i trên màn hình c&#7911;a các b&#7841;n v&#7899;i hình ch&#7909;p d&#432;&#7899;i &#273;ây<br>
[Only registered and activated users can see links]<br>
Sau &#273;ó b&#7841;n hãy ki&#7875;m tra toàn b&#7897; công vi&#7879;c c&#7911;a mình b&#7857;ng cách nh&#7845;n t&#7893;
h&#7907;p phím Shift-F11, &#273;ây là phím t&#7855;t ra l&#7879;nh cho NetBeans biên d&#7883;ch
(compile) và xây d&#7921;ng (build) toàn b&#7897; project, n&#7871;u trên tab Compiler
không báo l&#7895;i gì thì xin chúc m&#7915;ng b&#7841;n, b&#7841;n &#273;ã c&#7845;u hình NetBeans &#273;&#7875; xây
d&#7921;ng &#7913;ng d&#7909;ng J2ME thành công<br>
&#8226; Ch&#7841;y th&#7917; các tính n&#259;ng c&#7911;a &#273;i&#7879;n th&#7885;ai Samsung: Trong ph&#7847;n demo c&#7911;a
bài vi&#7871;t có &#273;&#7873; c&#7853;p &#273;&#7871;n các ch&#7913;c n&#259;ng mà MIDP 1.0 không cung c&#7845;p nh&#432; &#273;&#7885;c
file âm thanh, rung (vibration), hi&#7875;n th&#7883; &#273;èn LCD, g&#7917;i SMS. &#272;&#7875; ki&#7875;m tra
các tính n&#259;ng này trên b&#7897; gi&#7843; l&#7853;p Samsung, b&#7841;n làm nh&#432; sau:<br>
&#8226;    Ch&#7885;n ch&#432;&#417;ng trình gi&#7843; l&#7853;p Samsung: Tôi ch&#7885;n SGH-E100<br>
&#8226; B&#7845;m chu&#7897;t ph&#7843;i vào l&#7899;p SamsungDemoMidlet và ch&#7885;n menu Execute (ho&#7863;c
nh&#7845;n F6), n&#7871;u m&#7885;i chuy&#7879;n suôn s&#7867; thì c&#7917;a s&#7893; ch&#432;&#417;ng trình gi&#7843; l&#7853;p s&#7869;
hi&#7879;n ra. Cu&#7889;i cùng thì ch&#432;&#417;ng trình J2ME &#273;&#7847;u tiên c&#361;ng &#273;ã ch&#7841;y<br>
[Only registered and activated users can see links]<br>
Do ph&#7841;m vi bài vi&#7871;t có h&#7841;n nên tôi không &#273;&#7873; c&#7853;p sâu vào ph&#7847;n mã ngu&#7891;n, ph&#7847;n chi ti&#7871;t này s&#7869; &#273;&#432;&#7907;c h&#432;&#7899;ng d&#7851;n trong m&#7897;t bài khác.<br>
<br>
4. K&#7871;t lu&#7853;n: Trong ph&#7841;m vi bài vi&#7871;t này, tác gi&#7843; &#273;ã gi&#7899;i thi&#7879;u v&#7873; môi
tr&#432;&#7901;ng l&#7853;p trình NetBeans, phiên b&#7843;n 3.6 cho phép các l&#7853;p trình viên
phát tri&#7875;n các &#7913;ng d&#7909;ng J2ME m&#7897;t cách nhanh chóng nh&#7845;t. N&#7871;u &#273;&#7897;c gi&#7843; &#273;ã
có kinh nghi&#7879;m s&#7917; d&#7909;ng các công c&#7909; nh&#432; Jbuilder thì ch&#7855;c h&#7859;n r&#7857;ng các
b&#7841;n s&#7869; không m&#7845;t nhi&#7873;u th&#7901;i gian &#273;&#7875; làm quen v&#7899;i NetBeans và công c&#7909;
l&#7853;p trình J2ME c&#7911;a nó. Bài vi&#7871;t không &#273;&#7873; c&#7853;p &#273;&#7871;n cách s&#7917; d&#7909;ng các API
do Samsung SDK, ph&#7847;n này s&#7869; &#273;&#432;&#7907;c bàn &#273;&#7871;n chi ti&#7871;t trong m&#7897;t bài vi&#7871;t
khác. Bài vi&#7871;t c&#361;ng không &#273;&#7873; c&#7853;p &#273;&#7871;n quá trình g&#7905; l&#7895;i (debug) và ch&#7841;y
t&#7915;ng b&#432;&#7899;c, xem nh&#432; là bài t&#7853;p dành cho &#273;&#7897;c gi&#7843;.<br>
Khi &#273;&#7897;c gi&#7843; &#273;&#7885;c bài vi&#7871;t này thì phiên b&#7843;n NetBeans 4.1 v&#7899;i r&#7845;t nhi&#7873;u
nh&#7919;ng c&#7843;i ti&#7871;n &#273;ã ra m&#7855;t. Hi v&#7885;ng s&#7869; &#273;&#432;&#7907;c ti&#7871;p t&#7909;c bàn lu&#7853;n v&#7899;i ng&#432;&#7901;i
&#273;&#7885;c v&#7873; phiên b&#7843;n m&#7899;i này.<br>
 Ph&#7909; l&#7909;c : Các Plugins c&#7911;a NetBeans h&#7893; tr&#7907; J2ME<br>
1. kjava-emulator_win.nbm<br>
 Gói này ch&#7913;a các th&#432; vi&#7879;n c&#7911;a b&#7897; J2ME Wireless Toolkit 1.0.4. H&#7893; tr&#7907; MIDP 1.0<br>
[/URL][Only registered and activated users can see links] ([Only registered and activated users can see links])<br>
kjava-emulator_win.nbm<br>
 <br>
2. kjava.nbm<br>
Gói này ch&#7913;a các MIDP wizard (công c&#7909; cho phép t&#7841;o code t&#7921; &#273;&#7897;ng) và
MIDP templates. Gói này c&#361;ng bao g&#7891;m b&#7897; gi&#7843; l&#7853;p (Emulator) cho phép
test tr&#432;&#7899;c khi ch&#7841;y trên thi&#7871;t b&#7883; th&#7853;t [URL][Only registered and
activated users can see links]<br>
<br>
Ph&#7909; l&#7909;c 2: Các l&#7895;i th&#432;&#7901;ng g&#7863;p khi biên d&#7883;ch code J2ME b&#7857;ng NetBeans<br>
<br>
 1. NoClassDefFoundError<br>
 B&#7841;n &#273;ã ch&#7885;n sai &#273;&#432;&#7901;ng d&#7851;n trong FileSystem, hãy ch&#7855;c ch&#7855;n r&#7857;ng b&#7841;n có &#273;&#432;&#7901;ng d&#7851;n c:\SamsungDemo\src<br>
 <br>
2. java.lang.InstantiationException: Class not a MIDlet<br>
B&#7841;n &#273;ã ch&#7885;n sai class c&#7847;n &#273;&#7875; ch&#7841;y. Trong ph&#7847;n Source code mà chúng tôi
cung c&#7845;p thì ch&#7881; có l&#7899;p SamsungDemoMidlet là Main Class &#273;&#7875; có th&#7875; ch&#7841;y
tr&#7921;c ti&#7871;p.<br>
 <br>
 <br>
<br>
                                                            (theo JavaVietnam.Org)</div></div><hr>

<br><div style="text-align: center;"><table align="center" border="0" cellpadding="0" cellspacing="0">
<tbody><tr>
<td colspan="2">


<iframe src="su%20dung%20netbean_files/vocvitinh_728bottom.htm" allowtransparency="true" marginheight="0" marginwidth="0" scrolling="no" width="728" frameborder="0" height="90"></iframe>


</td>
</tr>
<tr>
<td align="left">
<font size="-3"><a href="http://www.vocvitinh.com/archive/index.php/payments.php"><b>join V.I.P and remove this ads</b></a></font></td>
<td align="right"><font size="-3"><a href="http://www.vocvitinh.com/archive/index.php/payments.php"><b>gia nh&#7853;p V.I.P s&#7869; không th&#7845;y qu&#7843;ng cáo
</b></a></font>
</td>
</tr>
</tbody></table></div><br>
<div id="copyright">vBulletin v3.6.2, Copyright ©2000-2009, Jelsoft Enterprises Ltd.</div>
</div>
</body></html>